{"pageProps":{"name":"Stocker","date":["2021.07","2021.12"],"desc":"Stock and cryptocurrency portfolio management system with real-time data. Revamped to provide cleaner layout, chart supports, and more.","link":["dashboard.stocker.nanistudio.org","stocker.nanistudio.org"],"source":[null,null],"images":["overview","stock","watchlist","watchlist_stock","settings","ticket","stocker_dashboard","stocker_transactions","stocker_batch"],"preview":"stocker_v2","image_dir":"stocker","tech":[["nextjs-plain-wordmark","sass-original","firebase-plain"],["nextjs-plain-wordmark","materialui-plain","firebase-plain"]],"features":[{"title":"Real-time Data","desc":"Stocker fetches real-time data for stocks and cryptocurrencies over trusted platforms and cross-references the data to ensure they are correct. It supports multiple currencies with up-to-date conversion rates, allowing users to access and manage their stocks transactions from different bourses and nations within one portfolio."},{"title":"Multiple Metrics","desc":"Stocker uses a vigorous calculation algorithm, aided with multiple indexes and news feed, to provide useful metrics and graphs to our users. Not only can they access to their portfolios and their corresponding performance, they can also monitor and compare favourable stocks in their watchlist. Additional features are provided for our VIP members to further evaluate their trading performace."},{"title":"Cross-platform Support","desc":"Stocker is avaliable on webpage, iOS App Store, and Google Play Store. With a single account, users can access their portfolio and subscription plans across all platforms. All data can be uploaded to database for storage and downloads; or, if users prefer instantaneous update between devices, synchronization are also supported for easy usage."},{"title":"Community and Technical Support","desc":"We value the feedback made by our users. Aside from constantly updating Stocker and lauching new features for our users, we utilize the in-app forum and external discussion threads to ensure their problems and suggestions are heard and dealed with within a short timeframe. Users can also report and track both their privately or publicly visible issues over our custom-made ticket system."}],"slug":"stocker"},"__N_SSG":true}